In [2]:
import pandas as pd

In [3]:
#sample dataframe used for example
data = [[7.2500, 'S', 'male', 22.0], [71.29, 'C', 'female', 38.0], [9, 'S', 'female', 26.0], [33, 'S', 'female', 26.0], [33, 'C', 'male', 26.0]] 
  
# Create the pandas DataFrame 
df = pd.DataFrame(data, columns = ['Fare', 'Embarked', 'Sex', 'Age']) 
  
# print dataframe. 
df

    Fare Embarked     Sex   Age
0   7.25        S    male  22.0
1  71.29        C  female  38.0
2   9.00        S  female  26.0
3  33.00        S  female  26.0
4  33.00        C    male  26.0

In [ ]:
#feature mask for extacting
#feature_columns = [c for c in dataframe.columns if c != 'targetcolumn']
#X = dataframe[feature_columns]

In [4]:
#feature mask for extacting
feature_columns = [c for c in df.columns if c != 'Age']
X = df[feature_columns]

In [5]:
X.head()

    Fare Embarked     Sex
0   7.25        S    male
1  71.29        C  female
2   9.00        S  female
3  33.00        S  female
4  33.00        C    male